# ## Log	:	This file is generated by Anlogic Timing Wizard.
# ## File	:	../constraint/25MHZ.sdc
# ## Date	:	08 01 2018

#Created Clock
#create_clock -name CLK25MHz -period 40 -waveform {0 20} [get_ports {CLK25MHZ}]
create_clock -name hfclk -period 119.218 [get_nets {hfclk}]
create_generated_clock -name slowclk -source [get_nets {hfclk}] -master_clock hfclk -divide_by 256 [get_nets {slowclk}]
set_false_path  -from [get_clocks "hfclk"] -to [get_clocks "slowclk"]
set_false_path  -from [get_clocks "slowclk"] -to [get_clocks "hfclk"]